<App>
  <div class="background" style="background-image: url({imagePath('background5')});">
    <div class="container">
      <p>
        Розтавивши правильну послідовність, верхня панель стола розкрилася.<br>
        Всередині був ключ.
      </p>
      <p>
        В наступній кімнаті інтер'єр кардинально відрізнявся від попередніх. Він нагадував дитячу гральну кімнату.
        Кубики, пластикові іграшки, пазли, настольні ігри про подорожі.
      </p>
      <p>
        Через мене пройшла струмова хвиля. Я розумію, чому я тут. В бібліотеці я шукала інформацію про дослідницьку роботу батька
        і натрапила на книгу, що відкрила таємний шлях. Від здивованості, я послизнулася і впала з крісла. Певно вдарилаяс по дорозі, що
        і викликало тимчасову амнезію. Поки не ясно, що ці кімнати роблять у мене під домом.
      </p>
      <p>
        І переді мною ще одна загадка. В цьому випадку буквально.
      </p>
      <p>
        Замість картини, посеред кімнати, висіла рамка з текстом посередині:<br>
      </p>
      <p class="italic-text">
        Коли їм, я на троні. Коли їду, я на троні<br>
        Мною радуються люди. Тому я дозволяю їм виконувати всі мої примхи.<br>
        Єдине, що мене бентежить, вони не знають моєї мови<br>
        Хто я?<br>
      </p>
      <p>
        На письмовому столі був встроєний планшет для вводу слова. На дверях, замок на віддаленому керуванні.
      </p>
      <p>(Відповідь слово кирилицею)</p>
      <AnswerForm questId={questId} />
    </div>
  </div>
</App>

<script>
  import App from "../components/App"
  import AnswerForm from "../components/AnswerForm"
  import { imagePath } from "../lib/helpers"

  export let questId
</script>

<style lang="scss">
  * {
    line-height: 25px;
  }

  .container {
    width: 60%;
    margin: 0 auto;

    p:first-child {
      margin-top: 0;
    }
  }

  .background {
    background-size: 100% 100%;
    background-repeat: no-repeat;
    min-height: 100vh;
  }

  .italic-text {
    font-style: italic;
  }
</style>
